results/4-nodes/cassandra/logs.txt
[OVERALL], RunTime(ms), 122473
[OVERALL], Throughput(ops/sec), 1183.7139614445632
[TOTAL_GCS_PS_Scavenge], Count, 131
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1301
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 1.0622749503972304
[TOTAL_GCS_PS_MarkSweep], Count, 7
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 152
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.12410898728699388
[TOTAL_GCs], Count, 138
[TOTAL_GC_TIME], Time(ms), 1453
[TOTAL_GC_TIME_%], Time(%), 1.1863839376842242
[CLEANUP], Operations, 250
[CLEANUP], AverageLatency(us), 8863.864
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 2215718
[CLEANUP], 0, 0.9959839357429718
[CLEANUP], 2000, 2215718.0
[INSERT], Operations, 7343
[INSERT], AverageLatency(us), 187618.34332016887
[INSERT], MinLatency(us), 392
[INSERT], MaxLatency(us), 857581
[INSERT], Return=OK, 7343
[INSERT], 0, 122971.3698630137
[INSERT], 1000, 155684.60869565216
[INSERT], 2000, 126402.87692307692
[INSERT], 3000, 163758.95081967214
[INSERT], 4000, 202784.28813559323
[INSERT], 5000, 101655.36538461539
[INSERT], 6000, 208177.8947368421
[INSERT], 7000, 253125.0357142857
[INSERT], 8000, 238459.35849056602
[INSERT], 9000, 199702.20512820513
[INSERT], 10000, 209814.96078431373
[INSERT], 11000, 177006.320754717
[INSERT], 12000, 188193.05
[INSERT], 13000, 167631.90384615384
[INSERT], 14000, 249618.11320754717
[INSERT], 15000, 206750.6779661017
[INSERT], 16000, 209808.55
[INSERT], 17000, 154962.58208955225
[INSERT], 18000, 147711.97333333333
[INSERT], 19000, 189558.57746478874
[INSERT], 20000, 201650.82258064515
[INSERT], 21000, 209840.03125
[INSERT], 22000, 139111.12962962964
[INSERT], 23000, 176211.50877192983
[INSERT], 24000, 208208.66666666666
[INSERT], 25000, 190416.109375
[INSERT], 26000, 164939.02777777778
[INSERT], 27000, 256841.6
[INSERT], 28000, 163129.9423076923
[INSERT], 29000, 205210.54411764705
[INSERT], 30000, 160426.8679245283
[INSERT], 31000, 158908.131147541
[INSERT], 32000, 183939.0
[INSERT], 33000, 160135.06451612903
[INSERT], 34000, 192147.96774193548
[INSERT], 35000, 169844.12280701756
[INSERT], 36000, 213456.08823529413
[INSERT], 37000, 174022.55
[INSERT], 38000, 191308.85483870967
[INSERT], 39000, 160783.16
[INSERT], 40000, 161354.0819672131
[INSERT], 41000, 195477.01449275363
[INSERT], 42000, 187201.14285714287
[INSERT], 43000, 251297.65217391305
[INSERT], 44000, 196049.85483870967
[INSERT], 45000, 189218.24444444446
[INSERT], 46000, 184512.75438596492
[INSERT], 47000, 223904.59375
[INSERT], 48000, 176755.2258064516
[INSERT], 49000, 211442.5806451613
[INSERT], 50000, 128012.98245614035
[INSERT], 51000, 122408.515625
[INSERT], 52000, 136247.6875
[INSERT], 53000, 180750.17460317462
[INSERT], 54000, 128681.40983606558
[INSERT], 55000, 176005.90740740742
[INSERT], 56000, 260647.8125
[INSERT], 57000, 231529.171875
[INSERT], 58000, 146858.17857142858
[INSERT], 59000, 184266.39215686274
[INSERT], 60000, 169365.16949152542
[INSERT], 61000, 168673.868852459
[INSERT], 62000, 158369.7619047619
[INSERT], 63000, 252585.42857142858
[INSERT], 64000, 164711.64912280702
[INSERT], 65000, 148823.0909090909
[INSERT], 66000, 197004.33333333334
[INSERT], 67000, 205613.33783783784
[INSERT], 68000, 214281.54794520547
[INSERT], 69000, 129980.75
[INSERT], 70000, 198787.64788732395
[INSERT], 71000, 133300.29824561405
[INSERT], 72000, 183234.13333333333
[INSERT], 73000, 250827.9298245614
[INSERT], 74000, 217021.68852459016
[INSERT], 75000, 212189.4090909091
[INSERT], 76000, 208684.28070175438
[INSERT], 77000, 147146.98039215687
[INSERT], 78000, 197530.0158730159
[INSERT], 79000, 217772.64516129033
[INSERT], 80000, 202967.54385964913
[INSERT], 81000, 176113.83076923076
[INSERT], 82000, 203061.05555555556
[INSERT], 83000, 185366.26666666666
[INSERT], 84000, 152957.16949152542
[INSERT], 85000, 174038.30434782608
[INSERT], 86000, 153472.49253731343
[INSERT], 87000, 193443.6811594203
[INSERT], 88000, 145737.39215686274
[INSERT], 89000, 179723.98387096773
[INSERT], 90000, 189366.375
[INSERT], 91000, 262341.0
[INSERT], 92000, 175066.95081967214
[INSERT], 93000, 214772.81666666668
[INSERT], 94000, 169486.07843137256
[INSERT], 95000, 197505.91044776118
[INSERT], 96000, 210685.88888888888
[INSERT], 97000, 181205.94
[INSERT], 98000, 198049.1090909091
[INSERT], 99000, 140269.2962962963
[INSERT], 100000, 181997.33333333334
[INSERT], 101000, 157880.05357142858
[INSERT], 102000, 221409.65625
[INSERT], 103000, 202832.4
[INSERT], 104000, 278295.89090909093
[INSERT], 105000, 181373.9746835443
[INSERT], 106000, 176547.301369863
[INSERT], 107000, 151306.10204081633
[INSERT], 108000, 202463.95774647887
[INSERT], 109000, 180326.0172413793
[INSERT], 110000, 211452.4393939394
[INSERT], 111000, 186914.60655737706
[INSERT], 112000, 187632.53488372092
[INSERT], 113000, 218398.36231884058
[INSERT], 114000, 184466.87931034484
[INSERT], 115000, 155118.86111111112
[INSERT], 116000, 185038.45070422534
[INSERT], 117000, 243914.953125
[INSERT], 118000, 261465.01492537314
[INSERT], 119000, 157426.31578947368
[SCAN], Operations, 137630
[SCAN], AverageLatency(us), 207153.49961490955
[SCAN], MinLatency(us), 967
[SCAN], MaxLatency(us), 891980
[SCAN], Return=OK, 137630
[SCAN], 0, 152834.03219315896
[SCAN], 1000, 183590.54673283704
[SCAN], 2000, 173649.44503078275
[SCAN], 3000, 214943.58348134992
[SCAN], 4000, 212875.84479717814
[SCAN], 5000, 225854.69527896994
[SCAN], 6000, 204123.61598609903
[SCAN], 7000, 222337.36233183855
[SCAN], 8000, 219462.31396357328
[SCAN], 9000, 202533.46242263482
[SCAN], 10000, 211465.63596491228
[SCAN], 11000, 196513.18975650714
[SCAN], 12000, 181312.28929188257
[SCAN], 13000, 206304.68733624453
[SCAN], 14000, 209871.38528138527
[SCAN], 15000, 198531.92314261314
[SCAN], 16000, 212328.4920774648
[SCAN], 17000, 231518.35360556038
[SCAN], 18000, 186133.21460374
[SCAN], 19000, 206371.9079754601
[SCAN], 20000, 211531.99571550987
[SCAN], 21000, 217012.3074912892
[SCAN], 22000, 216080.67272727273
[SCAN], 23000, 198807.6724286949
[SCAN], 24000, 195006.0344218888
[SCAN], 25000, 208988.9050966608
[SCAN], 26000, 205251.9411247803
[SCAN], 27000, 215419.99047619046
[SCAN], 28000, 214874.829535865
[SCAN], 29000, 190604.2010628875
[SCAN], 30000, 204930.7265625
[SCAN], 31000, 207837.06366047746
[SCAN], 32000, 231402.8243006993
[SCAN], 33000, 194096.3547826087
[SCAN], 34000, 212928.16710411198
[SCAN], 35000, 224508.62017543858
[SCAN], 36000, 202555.16549295775
[SCAN], 37000, 214333.57944732296
[SCAN], 38000, 218613.25444839857
[SCAN], 39000, 209426.21746575343
[SCAN], 40000, 201690.23764093668
[SCAN], 41000, 180902.52739726027
[SCAN], 42000, 216131.84219858155
[SCAN], 43000, 202289.49103330486
[SCAN], 44000, 190344.53424657535
[SCAN], 45000, 221048.78766519824
[SCAN], 46000, 208682.02836879433
[SCAN], 47000, 221873.38607050732
[SCAN], 48000, 212991.9756097561
[SCAN], 49000, 205746.5170305677
[SCAN], 50000, 211661.45
[SCAN], 51000, 227394.92093831452
[SCAN], 52000, 174956.46654772526
[SCAN], 53000, 214816.15304347826
[SCAN], 54000, 207029.29094236047
[SCAN], 55000, 220416.56017316016
[SCAN], 56000, 230919.6108714409
[SCAN], 57000, 185952.443596268
[SCAN], 58000, 190821.14705882352
[SCAN], 59000, 200879.4873524452
[SCAN], 60000, 211782.70790378007
[SCAN], 61000, 209572.66051011434
[SCAN], 62000, 212445.37803780378
[SCAN], 63000, 211986.56137339055
[SCAN], 64000, 218458.05506216697
[SCAN], 65000, 223973.8943161634
[SCAN], 66000, 216353.26110607435
[SCAN], 67000, 206774.61946902654
[SCAN], 68000, 212132.99215344377
[SCAN], 69000, 203086.18598615917
[SCAN], 70000, 182923.49220103986
[SCAN], 71000, 204125.31362467867
[SCAN], 72000, 207656.76252158894
[SCAN], 73000, 201142.71698113208
[SCAN], 74000, 204095.63563115487
[SCAN], 75000, 225834.59336823734
[SCAN], 76000, 202835.7841105354
[SCAN], 77000, 198313.3
[SCAN], 78000, 212521.72804774085
[SCAN], 79000, 196879.11413520633
[SCAN], 80000, 222628.7596412556
[SCAN], 81000, 205615.87274368232
[SCAN], 82000, 221277.0992167102
[SCAN], 83000, 206043.84446397188
[SCAN], 84000, 195704.87696335078
[SCAN], 85000, 212208.12091791703
[SCAN], 86000, 202280.6779949023
[SCAN], 87000, 203667.3208828523
[SCAN], 88000, 212644.76793622674
[SCAN], 89000, 219032.88729874775
[SCAN], 90000, 205487.1476683938
[SCAN], 91000, 209838.86488812394
[SCAN], 92000, 216188.99740932643
[SCAN], 93000, 206188.05512489233
[SCAN], 94000, 210382.73248945147
[SCAN], 95000, 198764.447944007
[SCAN], 96000, 211102.89139878366
[SCAN], 97000, 193754.60717410324
[SCAN], 98000, 189746.13620386642
[SCAN], 99000, 226381.4040139616
[SCAN], 100000, 218231.38183421516
[SCAN], 101000, 187377.89301503095
[SCAN], 102000, 215375.48888888888
[SCAN], 103000, 215364.98366294068
[SCAN], 104000, 209527.95328719722
[SCAN], 105000, 189568.91965811964
[SCAN], 106000, 198149.44632290787
[SCAN], 107000, 213711.59701492538
[SCAN], 108000, 220137.92708333334
[SCAN], 109000, 220285.38099389712
[SCAN], 110000, 206759.35121107267
[SCAN], 111000, 212811.39838129497
[SCAN], 112000, 216172.6696113074
[SCAN], 113000, 200537.9633187773
[SCAN], 114000, 174650.25300171526
[SCAN], 115000, 206823.07198612316
[SCAN], 116000, 204636.7576530612
[SCAN], 117000, 205194.75530035337
[SCAN], 118000, 220454.70915312233
[SCAN], 119000, 260121.56995581737